// pages/agreement/agreement.js
const htmlSnip =
`<div class="div_class">
  <div class="small_title bold_text">特别提示：</div>
  <p class="small_title bold_text">
  在使用2121眼镜商城之前，您（下列统称“用户”）应当认真阅读并遵守《用户服务协议》（以下简称“本协议”），请您务必审慎阅读、充分理解各条款内容，特别是免除 或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能将以加粗字体显示，您应重点阅读。如您对协议有任何疑问的，应向客服咨询。  
  </p>
  <p class="title">
  一、 协议范围
  </p>
  <p class="paragraphs">
  1、本服务条款是用户与2121眼镜商城的经营公司（以下简称“2121”）之间关于其注册以及使用2121眼镜商城提供的相关产品和服务所订立的协议。如用户选择以页面确认或其他任何方式明示或者默示表示接受本服务条款，或以下载、安装、登录等方式使用2121相关产品和服务，即表示用户与2121已达成协议，自愿接受本服务条款的所有内容。
  </p>
  <p class="paragraphs">
  2、除另行明确声明外，2121眼镜商城服务包含任何2121及其关联公司提供的基于互联网以及移动网的相关服务，且均受本协议约束。如果用户不同意本协议的约定，用户应立即停止注册/激活程序或停止使用2121眼镜商城服务。
  </p>
  <p class="paragraphs">
  3、本协议内容包括协议正文及所有2121已经发布或将来可能发布的各类规则、公告或通知（以下合称“2121规则”或“规则”）。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
  </p>
  <p class="paragraphs">
  4、2121有权根据需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行变更公告，无需另行单独通知用户。变更后的协议和规则一经在网站公布后，立即或在公告明确的特定时间自动生效。若用户不同意相关变更，应当立即停止使用2121眼镜商城服务。若用户在前述变更公告后继续使用2121眼镜商城服务的，即表示用户已经阅读、理解并接受经修订的协议和规则。
  </p>
  <p class="title">
  二、 注册与账户
  </p>
  <p class="small_title">
  1、主体资格
  </p>
  <p class="paragraphs">
  用户确认，在用户完成注册程序或以其他2121允许的方式实际使用2121眼镜商城服务时，用户应当是具备完全民事行为能力和完全民事权利能力的自然人、法人或其他组织。若用户不具备前述主体资格，则用户及用户的监护人应承担因此而导致的一切后果，且2121有权注销或永久冻结用户的账户，并向用户及用户的监护人索偿相应损失。
  </p>
  <p class="small_title">
  2、注册和账户
  </p>
  <p class="paragraphs">
  a）当用户按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在用户按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或用户以其他2121允许的方式实际使用2121眼镜商城服务时，用户即受本协议约束。用户可以使用用户提供或确认的手机号码作为登录方式进入2121眼镜商城。
  </p>
  <p class="paragraphs">
  b）用户可以对账户设置2121昵称，用户设置的2121昵称不得侵犯或涉嫌侵犯他人合法权益。如用户设置的2121昵称涉嫌侵犯他人合法权益，2121有权终止向用户提供2121眼镜商城服务，注销用户的2121昵称。
  </p>
  <p class="paragraphs">
  c）用户的登录名、2121昵称和密码不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经2121同意，且需提供2121要求的合格的文件材料并根据2121制定的操作流程办理。
  </p>
  <p class="small_title">
  3、用户信息
  </p>
  <p class="paragraphs">
  a）在注册或激活流程时，用户应当依照法律法规要求，按相应页面的提示准确提供用户的资料，并于资料信息变更时及时更新，以保证用户所提交资料的真实、及时、完整和准确。如2121根据自身独立判断认为用户提供的资料存在错误、不实、过时或不完整的风险时，2121有权向用户发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对用户提供部分或全部2121眼镜商城服务。2121对此不承担任何责任，用户将承担因此产生的任何直接或间接损失及不利后果。
  </p>
  <p class="paragraphs">
  b）用户应当准确填写并及时更新用户提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便2121或其他用户与用户进行有效联系，因通过这些联系方式无法与用户取得联系，导致用户在使用2121眼镜商城服务过程中产生任何损失或增加费用的，应由用户完全独自承担。用户了解并同意，用户有义务保持你提供的联系方式的真实性和有效性，如有变更或需要更新的，用户应按2121的要求进行操作。
  </p>
  <p class="paragraphs">
  c）用户确认，2121可根据自身业务需要使用用户的注册信息，2121承诺该等使用符合国家法律法规的相关规定。用户在此确认，所有2121用户资料（包括但不限于买家、商户的注册信息、网站交易信息等，以下简称“用户资料”）所包含的一切财产性权利均归属2121独家所有。就用户在使用2121服务时获得的其他用户资料，用户仅可根据2121规则在为使用2121服务所必须的范围内使用，用户应承诺不得将其他用户资料披露予任何第三方或将其用于2121明确许可外的其他用途。在用户终止使用2121服务后，本条规定对用户与2121仍有约束力。
  </p>
  <p class="small_title">
  4、账户安全
  </p>
  <p class="paragraphs">
  用户须自行负责对用户的2121昵称、密码、安全及保密，且须对用户在该登录名、2121昵称和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。用户同意：
  </p>
  <p class="paragraphs">
  a) 如发现任何人未经授权使用用户的登录名、2121昵称和密码，或发生违反保密规定的任何其他情况，用户会立即通知2121眼镜商城客服管理人员，并授权2121眼镜商城客服管理人员将该账号冻结；
  </p>
  <p class="paragraphs">
  b) 确保用户在每个上网时段结束时，以正确步骤离开网站/服务。2121不能也不会对因用户未能遵守本款规定而发生的任何损失负责。用户理解2121对用户的请求采取行动需要合理时间，2121对在采取行动前已经产生的后果（包括但不限于用户的任何损失）不承担任何责任。
  </p>
  <p class="paragraphs">
  c）用户因为手机丢失导致的经济等损失，2121眼镜商城不承担责任。
  </p>
  <p class="title">
  三、 2121眼镜商城服务
  </p>
  <p class="paragraphs">
  1、通过2121及其关联公司提供的2121眼镜商城服务和其它服务，用户可在2121眼镜商城上查询商品和发送服务信息、达成交易意向并进行交易、对其他用户进行评价、参加2121组织的活动以及使用其它信息服务及技术服务，具体以所开通的平台提供的服务内容为准。
  </p>
  <p class="paragraphs">
  2、您在2121眼镜商城上交易过程中与其他用户发生交易纠纷时，一旦您或其它用户任一方或双方共同提交2121要求调处，则2121作为独立第三方，有权根据单方判断做出调处决定，您了解并同意接受2121的判断和调处决定。
  </p>
  <p class="paragraphs">
  3、您了解并同意，2121有权应政府部门（包括司法及行政部门）的要求，向其提供您向2121提供的用户信息和交易记录等2121信息。如您涉嫌侵犯他人知识产权等合法权益，则2121亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您2121的身份信息。
  </p>
  <p class="paragraphs">
  4、您在使用2121眼镜商城服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。
  </p>
  <p class="small_title bold_text">
  5、2121眼镜商城提示您，产品“由某制造商出品”仅为陈述制造商既往生产经历，并不意味着相应产品与特定品牌产品相同或近似。
  </p>
  <p class="small_title bold_text">
  6、在使用2121眼镜商城的定制服务时，您可上传您享有为使用相应服务所必须的全部合法权益的设计作品，并应遵守2121眼镜商城对定制服务制定的相关规则。用户确认，本条规定所称设计作品是指用户自行上传至2121眼镜商城的作品（包括图片、文字及其组合）。
  </p>
  <p class="title">
  四、2121眼镜商城服务使用规范
  </p>
  <p class="small_title">
  1、在2121眼镜商城上使用2121服务过程中，您承诺遵守以下约定：
  </p>
  <p class="paragraphs">
  a)实施的所有行为均遵守国家法律、法规等规范性文件及2121眼镜商城各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本协议及相关规则。
  </p>
  <p class="paragraphs">
  b)在与其他用户交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。
  </p>
  <p class="paragraphs">
  c)不发布国家禁止销售的或限制销售的商品或服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息， 不发布违背社会公共利益或公共道德或2121认为不适合在2121眼镜商城上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。
  </p>
  <p class="paragraphs">
  d)不以包括但不限于虚构或歪曲事实等可能侵害其他用户合法权益的方式不当评价其他用户，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高（降低）其他用户的信用度。
  </p>
  <p class="paragraphs">
  e)不对2121眼镜商城上的任何数据作商业性利用，包括但不限于在未经2121事先书面同意的情况下，以复制、传播等任何方式使用2121眼镜商城站上展示的资料。
  </p>
  <p class="paragraphs">
  f)不使用任何方式干预或试图干预2121眼镜商城的正常运作或正在2121眼镜商城上进行的任何交易、活动或2121眼镜商城任何功能或侵害任何第三方的合法权利，也不得制作、发布、传播上述工具、方法等。您不得采取任何将导致不合理的庞大数据负载加诸2121眼镜商城网络设备的行动。
  </p>
  <p class="paragraphs">
  g）不得删除、隐匿、改变2121眼镜商城显示或其中包含的任何专利、著作权、商标或其他所有权声明； 
  </p>
  <p class="paragraphs">
  h) 不得避开、尝试避开或声称能够避开任何内容保护机制，或导致用户认为其直接与2121眼镜商城及2121眼镜商城相关产品进行交互； 
  </p>
  <p class="paragraphs">
  i）不得请求、收集、索取或以其他方式获取用户2121眼镜商城服务的登录帐号、密码或其他任何身份验证凭据，不得为任何用户自动登录到2121眼镜商城提供代理身份验证凭据；； 
  </p>
  <p class="paragraphs">
  j)不得在未经过用户同意的情况下，向任何其他用户及他方显示或以其他任何方式提供该用户的任何信息；
  </p>
  <p class="paragraphs">
  k）不得提供跟踪功能，包括但不限于识别其他用户在个人主页上查看、点击等操作行为； 
  </p>
  <p class="paragraphs">
  l）不得未经授权获取对2121眼镜商城产品或服务的访问权； 
  </p>
  <p class="paragraphs">
  m）不得以任何明示或暗示的方式表明，您与2121眼镜商城之间存在合作关系，包括但不限于相互持股、商业往来或合作关系等，或声称2121眼镜商城对您的认可； 
  </p>
  <p class="paragraphs">
  n）不得以任何形式宣传第三方网站、应用、产品或其他未经2121眼镜商城授权之个人、企业、工作室等的任何内容（包括但不限于商标、Logo、企业字号、作者/作品信息等）；
  </p>
  <p class="paragraphs">
  o）在使用2121眼镜商城定制服务时，您应保证就您所上传的设计作品享有为使用相应服务所必须的全部合法权利（包括系您原创作品或您已取得权利人的合法授权）；保证设计作品内不得使用包括但不限于“2121眼镜商城”、 “2121 eyewear”、“2121”、或其他2121眼镜商城商标标识或其任何变体、缩写、改写等；保证设计作品的内容、设计作品的上传使用等不得违反我国法律法规的相关规定，且不应侵犯任何人的合法权益，包括但不限于著作权、商标权、肖像权、名誉权、姓名权等。
  </p>
  <p class="paragraphs">
  p）在使用2121眼镜商城定制服务时，2121眼镜商城有权要求您就设计作品提供相关权利证明文件、授权文件、相关机构颁发的权利证书等，您应当配合提供，并应就所提供材料的真实性、有效性负责。 
  </p>
  <p class="paragraphs">
  q) 就您在使用2121眼镜商城人脸融合服务功能（即您使用该功能将您提交的图片与另一张图片进行融合的技术服务）时向2121眼镜商城提交的图片，您保证提交的所有图片及图片的使用不会违反任何法律法规、不会侵犯任何第三方的肖像权、知识产权及其他合法权利，且授权2121眼镜商城有权将其提交予第三方技术服务方以完成服务。否则您应自行承担由此引发的责任及损失，并保证2121眼镜商城就此免责，2121眼镜商城对图片内容的审核行为不减免您的任何责任。
  </p>
  <p class="small_title">
  2、您了解并同意：
  </p>
  <p class="paragraphs">
  a)您如果违反本协议项下规定，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保2121免于因此产生任何损失或增加费用。
  </p>
  <p class="paragraphs">
  b)基于维护2121眼镜商城交易秩序及交易安全的需要，2121有权根据自身独立判断在认为存在发生恶意购买等扰乱市场正常交易秩序风险的情形下，采取关闭相应交易订单、限制交易、冻结账户等一项或多项操作。
  </p>
  <p class="paragraphs">
  c)经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者2121根据自身的判断，认为您的行为涉嫌违反法律法规的规定或涉嫌违反本协议和/或规则的条款的，则2121有权在2121眼镜商城上公示您的该等涉嫌违法或违约行为及2121已对您采取的措施。
  </p>
  <p class="paragraphs">
  d)对于您在2121眼镜商城上发布的涉嫌违法、涉嫌侵犯他人合法权利或违反本协议和/或规则的信息（包括但不限于商品信息、设计作品等），2121有权不经通知您即予以删除，且按照规则的规定进行处罚。
  <span class="small_title bold_text">
  对于侵犯他人合法权益的设计作品，假设您对该作品进行修改后不再侵犯他人的合法权益，您同意2121眼镜商城仍然有权对修改后的作品进行下架处理。同时，若有需要，您可以将修改后的不再侵犯他人合法权益的作品作为新作品按照2121眼镜商城的流程、规范等重新上传。 
  </span>
  </p>
  <p class="paragraphs">
  e)对于您违反本协议项下承诺，或您在2121眼镜商城上实施的行为，包括您未在2121眼镜商城上实施但已经对2121眼镜商城及其用户产生影响的行为，2121有权根据自身独立判断认定您行为的性质及是否构成对本协议和/或规则的违反，并根据单方认定结果适用规则予以处理或终止向您提供全部或部分服务，且无须征得您的同意或提前通知予您。您 应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。
  </p>
  <p class="small_title bold_text">
  f) 就2121所提供定制服务，2121仅为向用户提供上传服务、信息空间存储服务及其他相关中立的技术支持服务；如因用户的设计作品产生的任何纠纷、责任（包括但不限于设计作品的上传、使用等），均由用户独立承担责任、赔偿损失。
  </p>
  <p class="small_title bold_text">
  g）就您在使用2121眼镜商城服务过程中提交的资料和信息，您认可2121眼镜商城仅有能力对其进行形式审核，并不对您的相关行为承担任何责任或提供任何担保。如由此导致您与其他用户或第三方发生争议的，由您独立对外承担责任。 
  </p>
  <p class="paragraphs">
  h）为向用户提供更专业的服务，您同意授权2121眼镜商城可以（但无义务）委托第三方对您所提交的资料进行审核，并根据审核情况进行独立判断后确定审核结果。
  </p>
  <p class="paragraphs">
  I）如您涉嫌违反有关法律或者本协议之规定，使2121遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿2121因此造成的损失和/或发生的费用，包括合理的律师费用。
  </p>
  <p class="title">
  五、特别授权
  </p>
  <p class="paragraphs">
  您完全理解并不可撤销地授予2121及其关联公司下列权利：
  </p>
  <p class="paragraphs">
  1、您完全理解并不可撤销地授权2121或2121授权的第三方或您与2121一致同意的第三方，根据本协议及2121规则的规定，处理您在2121眼镜商城上发生的 所有交易及可能产生的交易纠纷。您同意接受2121或2121授权的第三方或您与2121一致同意的第三方的判断和调处决定。该决定将对您具有法律约束力。
  </p>
  <p class="small_title bold_text">
  2、除本协议另有约定外，一旦您接受本协议，即表明您主动将您在任何时间段在2121眼镜商城发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章、图片、设计作品等信息内容）的财产性权利等任何可转让的权利，如 著作财产权（包括但不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销的转让给2121所有，用户同意2121有权就任何主体侵权而单独提起诉讼。本条款同时已构成《著作权法》第二十五条及相关法律规定规定的著作权财产等权利转让书面协议，其效力及于用户在2121眼镜商城上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。除非法律另有强制性规定，您认可未经2121明确的书面许可，您不得将相应信息在其他第三方网站、平台发表，任何单位或个人不得以任何形式非法的全部或部分复制、转载、引用、链接、专区或以其他形式使用本站的信息内容，否则2121有权追究其法律责任。
  </p>
  <p class="paragraphs">
  3、一旦您向2121和/或其关联公司，作出任何形式的承诺，且相关公司已确认您违反了该承诺，则2121有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，2121无须就相关确认与您核对事实，或另行征得您的同意，且2121无须就此限制措施或公示行为向您承担任何的责任。
  </p>
  <p class="paragraphs">
  4、一旦您违反本协议，或与2121签订的其他协议的约定，2121有权以任何方式通知2121关联公司要求其对您的权益采取限制措施，要求2121与关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。
  </p>
  <p class="title">
  六、责任范围和责任限制
  </p>
  <p class="paragraphs">
  1、2121负责按"现状"和"可得到"的状态向您提供2121眼镜商城服务。但2121对2121眼镜商城服务不作任何明示或暗示的保证，包括但不限于2121眼镜商城服务 的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，2121也不对2121眼镜商城服务所涉及的技术及信息的有效性、准确性、正确性、可 靠性、质量、稳定、完整和及时性做出任何承诺和保证。
  </p>
  <p class="paragraphs">
  2、除非法律法规明确要求，或出现以下情况，否则，2121没有义务对所有用户的信息数据、商品和服务信息、交易行为以及与交易有关的其它事项进行事先审查：
  </p>
  <p class="paragraphs">
  a)2121有合理的理由认为特定用户及具体交易事项可能存在重大违法或违约情形。
  </p>
  <p class="paragraphs">
  b)2121有合理的理由认为用户在2121眼镜商城的行为涉嫌违法或不当。
  </p>
  <p class="paragraphs">
  3、2121或2121授权的第三方或您与2121一致同意的第三方有权基于您不可撤销的授权受理您与其他用户因交易产生的争议，并有权单方判断与该争议 相关的事实及应适用的规则，进而作出处理决定，包括但不限于调整相关订单的交易状态。该处理决定对您有约束力。如您未在限期内执行处理决定的，则2121有权利（但无义务）直接使用您2121账户内的款项，或您向2121及其关联公司交纳的保证金代为支付。您应在3日内补足保证金并弥补2121及其关联公司的损失，否则2121及其关联公司有权直接抵减您在其它合同项下的权益，并有权继续追偿。
  </p>
  <p class="paragraphs">
  您理解并同意，2121或2121授权的第三方或您与2121一致同意的第三方并非司法机构，仅能以普通人的身份对证据进行鉴别，2121或2121授权的第三方或您与 2121一致同意的第三方对争议的调处完全是基于您不可撤销的授权，其无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。
  </p>
  <p class="paragraphs">
  4、您了解并同意，2121不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论2121是否已被告知该等损害赔偿的可能性) ：
  </p>
  <p class="paragraphs">
  a)使用或未能使用2121眼镜商城服务。
  </p>
  <p class="paragraphs">
  b)第三方未经批准的使用您的账户或更改您的数据。
  </p>
  <p class="paragraphs">
  c)通过2121眼镜商城服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失。
  </p>
  <p class="paragraphs">
  d)您对2121眼镜商城服务的误解。
  </p>
  <p class="paragraphs">
  e)任何非因2121的原因而引起的与2121眼镜商城服务有关的其它损失。
  </p>
  <p class="paragraphs">
  5、不论在何种情况下，2121均不对由于信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议， 暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。
  </p>
  <p class="title">
  七、协议终止
  </p>
  <p class="paragraphs">
  1、您同意，2121有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部2121眼镜商城服务，暂时冻结或永久冻结（注销）您的账户在2121眼镜商城的权限，且无须为此向您或任何第三方承担任何责任。
  </p>
  <p class="paragraphs">
  2、出现以下情况时，2121有权直接以注销账户的方式终止本协议，并有权永久冻结您的账户在2121眼镜商城的权限和收回账户对应的2121昵称。
  </p>
  <p class="paragraphs">
  a)2121终止向您提供服务后，您涉嫌再一次直接或间接以他人名义注册为2121用户的；
  </p>
  <p class="paragraphs">
  b)您提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或2121以其它联系方式通知您更改电子邮件信息，而您在2121通知后三个工作日内仍未更改为有效的电子邮箱的。
  </p>
  <p class="paragraphs">
  c)您提供的用户信息中的主要内容不真实或不准确或不及时或不完整；
  </p>
  <p class="paragraphs">
  d)本协议（含规则）变更时，您明示并以书面形式通知2121不愿接受新的服务协议的；
  </p>
  <p class="paragraphs">
  e)其它2121认为应当终止服务的情况。
  </p>
  <p class="paragraphs">
  3、您的账户服务被终止或者账户在2121眼镜商城的权限被永久冻结（注销）后，2121没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。
  </p>
  <p class="paragraphs">
  4、您同意，您与2121的合同关系终止后，2121仍享有下列权利：
  </p>
  <p class="paragraphs">
  a）继续保存您的用户信息及您使用2121眼镜商城服务期间的所有交易信息。
  </p>
  <p class="paragraphs">
  b)您在使用2121眼镜商城服务期间存在违法行为或违反本协议和/或规则的行为的，2121仍可依据本协议向您主张权利。
  </p>
  <p class="paragraphs">
  5、2121中止或终止向您提供2121眼镜商城服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保2121免于因此产生任何损失或承担任何费用：
  </p>
  <p class="paragraphs">
  a)您在服务中止或终止之前已经上传至2121眼镜商城的商品或服务尚未交易的，2121有权在中止或终止服务的同时删除此项商品或服务的相关信息；
  </p>
  <p class="paragraphs">
  b)您在服务中止或终止之前已经与其他用户达成买卖合同，但合同尚未实际履行的，2121有权删除该买卖合同及其交易商品或服务的相关信息；
  </p>
  <p class="paragraphs">
  c)您在服务中止或终止之前已经与其他用户达成买卖合同且已部分履行的，2121可以不删除该项交易，但2121有权在中止或终止服务的同时将相关情形通知您的交易对方。
  </p>
  <p class="title">
  八、法律适用、管辖与其他
  </p>
  <p class="paragraphs">
  1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例。
  </p>
  <p class="paragraphs">
  2、本协议包含了您使用2121眼镜商城需遵守的一般性规范，您在使用2121眼镜商城时还需遵守适用于该平台的特殊性规范（具体请参见您与该平台签署的其他协议以及平台规则等内容）。一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。
  </p>
  <p class="paragraphs">
  3、因本协议产生之争议需根据您使用的服务归属的平台确定具体的争议对象，例如因您使用2121服务所产生的争议应由2121的经营者与您沟通并处理。一旦产生争议，您与2121眼镜商城的经营者均同意将争议提交至上海仲裁委员会通过仲裁方式解决。
  </p>
</div>
`

Page({

  /**
   * 页面的初始数据
   */
  data: {
    htmlSnip
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})